template.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
    <soap12:Body>
        <AddParcel xmlns="https://labelservice.gls-italy.com/">
            <XMLInfoParcel>
                <Info>
                    <SedeGls>AL</SedeGls>
                    <CodiceClienteGls>659</CodiceClienteGls>
                    <PasswordClienteGls>glsale</PasswordClienteGls>
                    <Parcel>
                        <CodiceContrattoGls>1000</CodiceContrattoGls>
                        <RagioneSociale>ff</RagioneSociale>
                        <Indirizzo>Via Achille Sclavo</Indirizzo>
                        <Localita>Alessandria</Localita>
                        <Zipcode>15121</Zipcode>
                        <Provincia>AL</Provincia>
                        <Bda></Bda>
                        <Colli>1</Colli>
                        <Incoterm></Incoterm>
                        <PesoReale>1</PesoReale>
                        <ImportoContrassegno></ImportoContrassegno>
                        <NoteSpedizione></NoteSpedizione>
                        <TipoPorto></TipoPorto>
                        <Assicurazione></Assicurazione>
                        <PesoVolume></PesoVolume>
                        <TipoCollo></TipoCollo>
                        <FrancoAnticipata></FrancoAnticipata>
                        <RiferimentoCliente></RiferimentoCliente>
                        <NoteAggiuntive></NoteAggiuntive>
                        <CodiceClienteDestinatario></CodiceClienteDestinatario>
                        <Email></Email>
                        <Cellulare1></Cellulare1>
                        <ServiziAccessori></ServiziAccessori>
                        <ModalitaIncasso></ModalitaIncasso>
                        <DataPrenotazioneGDO></DataPrenotazioneGDO>
                        <OrarioNoteGDO></OrarioNoteGDO>
                        <GeneraPdf></GeneraPdf>
                        <ContatoreProgressivo></ContatoreProgressivo>
                        <NumDayListSped></NumDayListSped>
                        <IdentPIN></IdentPIN>
                        <AssicurazioneIntegrativa></AssicurazioneIntegrativa>
                        <TipoSpedizione></TipoSpedizione>
                        <ValoreDichiarato></ValoreDichiarato>
                        <PersonaRiferimento></PersonaRiferimento>
                        <Contenuto></Contenuto>
                        <TelefonoDestinatario></TelefonoDestinatario>
                        <CategoriaMerceologica></CategoriaMerceologica>
                        <FatturaDoganale></FatturaDoganale>
                        <DataFatturaDoganale></DataFatturaDoganale>
                        <PezziDichiarati></PezziDichiarati>
                        <NazioneOrigine></NazioneOrigine>
                        <TelefonoMittente></TelefonoMittente>
                    </Parcel>
                </Info>
            </XMLInfoParcel>
        </AddParcel>
    </soap12:Body>
</soap12:Envelope>